[{"video_path": "D:\\VLM\\Fighting013_x264.mp4", "start_time_offset": "00:00:00", "end_time_offset": "00:00:19", "absolute_start_time": "2025-09-08 21:10:39", "absolute_end_time": "2025-09-08 21:10:58", "start_frame": 0, "end_frame": 594, "document": "The following event occurred in the video 'Fighting013_x264.mp4' between 2025-09-08 21:10:39 and 2025-09-08 21:10:58. Location: Indoor, dimly lit venue, likely a nightclub, bar, or event space.. Activity: A sequence of images from a high-angle security camera capturing a violent altercation. An initial interaction escalates into a physical assault by two individuals on an older, seated man.. Objects detected: Chair/Stool, Bar/Stage edge, Railing/Pole. Suspicious event: An altercation unfolds in several stages. Initially, two older men (one in a suit, one with white hair) are seen with a third man (shaved head), who is pushed or falls away. The man in the suit then sits on a stool. A fourth man (in a t-shirt) approaches aggressively, followed by a fifth man. These two new individuals launch a coordinated and sudden physical attack on the seated man, punching him and violently pulling him from the stool onto the floor.. "}, {"video_path": "D:\\VLM\\Fighting013_x264.mp4", "start_time_offset": "00:00:20", "end_time_offset": "00:00:39", "absolute_start_time": "2025-09-08 21:10:59", "absolute_end_time": "2025-09-08 21:11:18", "start_frame": 600, "end_frame": 1194, "document": "The following event occurred in the video 'Fighting013_x264.mp4' between 2025-09-08 21:10:59 and 2025-09-08 21:11:18. Location: Outdoor/semi-enclosed area, possibly an alley or doorway. Footage is watermarked 'LIVERPOOL SCAN'.. Activity: A violent physical altercation involving at least four men captured on security footage. The fight escalates from a two-person struggle to a multi-person brawl, during which a chair or stool is used as an improvised weapon.. Objects detected: Chair/Stool, Clothing (suit, tie, shirts), Doorway/Wall. Suspicious event: The altercation begins with one man in a suit physically restraining another man against a wall. The conflict rapidly escalates as at least two other men join the fray. One of the new individuals lifts a piece of furniture, appearing to be a chair or stool, and swings it as a weapon into the group. The scene devolves into a chaotic brawl with multiple individuals involved in punching and grappling.. "}, {"video_path": "D:\\VLM\\Fighting013_x264.mp4", "start_time_offset": "00:00:40", "end_time_offset": "00:00:47", "absolute_start_time": "2025-09-08 21:11:19", "absolute_end_time": "2025-09-08 21:11:26", "start_frame": 1200, "end_frame": 1428, "document": "The following event occurred in the video 'Fighting013_x264.mp4' between 2025-09-08 21:11:19 and 2025-09-08 21:11:26. Location: An indoor entryway or doorway, possibly an elevator lobby or a secure entrance to a building.. Activity: A sequence of events captured by a security camera showing an altercation at a doorway. The scene begins with several individuals near a door, one of whom is interacting with it, and progresses to an individual being on the floor with another person, possibly a security guard, standing over them.. Objects detected: Door/Gate, Floor, Walls, Uniformed shirt. Suspicious event: The sequence of images depicts a potential altercation or forced entry attempt. An individual in a light-colored shirt is first seen at a door. Subsequent images show a different individual on the ground in the same area. A person wearing what appears to be a uniform is then seen standing over the person on the floor, suggesting a confrontation that has escalated to physical incapacitation.. "}, {"video_path": "D:\\VLM\\Vandalism012_x264.mp4", "start_time_offset": "00:00:00", "end_time_offset": "00:00:19", "absolute_start_time": "2025-09-08 23:30:16", "absolute_end_time": "2025-09-08 23:30:35", "start_frame": 0, "end_frame": 594, "document": "The following event occurred in the video 'Vandalism012_x264.mp4' between 2025-09-08 23:30:16 and 2025-09-08 23:30:35. Location: An outdoor urban street corner, likely a town center, with a paved sidewalk and a road.. Activity: Two individuals appear on a sidewalk in the early hours of the morning. One person picks up a large white object from the ground and runs away with it, followed by the second person.. Objects detected: sidewalk, road, streetlights, building facade, utility box/bin, car, benches, large white panel/sign. Suspicious event: Two individuals run onto the sidewalk. One person, wearing a dark jacket over a light-colored shirt, picks up a large white panel-like object from the ground and runs out of the camera's field of view. The second individual, wearing a dark hooded jacket, follows him. The action suggests theft of property or vandalism.. "}, {"video_path": "D:\\VLM\\Vandalism012_x264.mp4", "start_time_offset": "00:00:20", "end_time_offset": "00:00:28", "absolute_start_time": "2025-09-08 23:30:36", "absolute_end_time": "2025-09-08 23:30:44", "start_frame": 600, "end_frame": 840, "document": "The following event occurred in the video 'Vandalism012_x264.mp4' between 2025-09-08 23:30:36 and 2025-09-08 23:30:44. Location: An outdoor, urban street corner with storefronts, likely in Sussex, UK.. Activity: A single individual is recorded on a security camera carrying a heavy-looking white box, abandoning it on a public sidewalk, and then leaving the scene. The event takes place in the early hours of the morning.. Objects detected: person, large white rectangular box (possibly a safe), sidewalk, road, streetlights, buildings, trash bin, vehicle (in background). Suspicious event: An unidentified person dressed in dark clothing is seen carrying a large, heavy, white rectangular object. The person appears to struggle with the object before dropping it on the sidewalk at 03:45:49 and quickly leaving the frame. The abandonment of a potential safe in this manner at this time is highly suspicious, suggesting it may be related to a theft or burglary.. "}, {"video_path": "D:\\VLM\\video.mp4", "start_time_offset": "00:00:00", "end_time_offset": "00:00:19", "absolute_start_time": "2025-09-07 23:27:04", "absolute_end_time": "2025-09-07 23:27:23", "start_frame": 0, "end_frame": 594, "document": "The following event occurred in the video 'video.mp4' between 2025-09-07 23:27:04 and 2025-09-07 23:27:23. Location: Interior of a public bus, rear section.. Activity: A single individual is observed at the rear of an otherwise empty bus. The person places a bag on the floor, sits down, removes their outer pants, and then moves towards the front of the bus, leaving the bag behind.. Objects detected: Bus seats, Handrails, Stanchion poles, Windows, Overhead lighting, A dark-colored bag/backpack, Fire extinguisher in a compartment. Suspicious event: An individual places a dark-colored bag on the floor in the rear of the bus. They then sit down, remove their outer pants (camouflage pattern), significantly altering their appearance. Subsequently, they move away towards the front of the bus, leaving the bag unattended. This sequence of actions is highly suspicious and could be consistent with abandoning a package.. "}, {"video_path": "D:\\VLM\\video.mp4", "start_time_offset": "00:00:20", "end_time_offset": "00:00:39", "absolute_start_time": "2025-09-07 23:27:24", "absolute_end_time": "2025-09-07 23:27:43", "start_frame": 600, "end_frame": 1194, "document": "The following event occurred in the video 'video.mp4' between 2025-09-07 23:27:24 and 2025-09-07 23:27:43. Location: Interior of a public transit bus, rear section, facing forward.. Activity: A sequence of security camera images shows a male individual boarding an empty bus. He proceeds to the rear, places a bag on the floor, and appears to interact with it. After he moves away, a bright flash and fire erupt from the bag's location, quickly filling the bus with light and smoke. The event is consistent with an act of arson or the detonation of an incendiary device.. Objects detected: Bus seats, Handrails, Stanchions, Hanging straps, Windows, Interior fluorescent lighting, Backpack/bag, Fire, Smoke. Suspicious event: A lone male individual places a dark bag on the floor in the elevated rear section of the bus. He bends over and manipulates the bag (images 4-6). After he moves away from the bag (image 7), a powerful explosion or flash fire occurs at the bag's location (images 8-10), engulfing the rear of the bus in flames and smoke. The individual is seen reacting to the blast before moving out of frame.. "}, {"video_path": "D:\\VLM\\video.mp4", "start_time_offset": "00:00:40", "end_time_offset": "00:00:44", "absolute_start_time": "2025-09-07 23:27:44", "absolute_end_time": "2025-09-07 23:27:48", "start_frame": 1200, "end_frame": 1344, "document": "The following event occurred in the video 'video.mp4' between 2025-09-07 23:27:44 and 2025-09-07 23:27:48. Location: Interior of a public transport vehicle, likely the upper deck of a double-decker bus.. Activity: The images depict a static scene from a security camera on an apparently empty upper deck of a bus. A single, partially obscured individual is visible standing near the top of the stairs. The image quality is low and grainy, with significant light glare.. Objects detected: Bus seats, Stairs, Handrails, Windows, Interior lighting. Suspicious event: A lone individual is standing on an otherwise empty upper deck of a bus. Due to the poor image quality, their posture, identity, and intentions cannot be determined. The situation is ambiguous and lacks context, but the presence of a single person in this manner could be a point of interest in a broader investigation.. "}]